IdeaRS.OpenModel.Concrete.TypeOfSupportConditions
Define type of support conditions

IdeaRS.OpenModel.Concrete.TypeOfSupportConditions.NonContinuous
Non-continuous members

IdeaRS.OpenModel.Concrete.TypeOfSupportConditions.Continuous
Continuous members

IdeaRS.OpenModel.Concrete.TypeOfSupportConditions.FullyRestrained
Supports considered fully restrained

IdeaRS.OpenModel.Concrete.TypeOfSupportConditions.Bearing
Bearing provided

IdeaRS.OpenModel.Concrete.TypeOfSupportConditions.Cantilever
Cantilever